{"modelTopology": {"node": [{"name": "Variable_47", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "Variable_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_37", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "Variable_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_29", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "Variable_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_36", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "Variable_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul_16/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add_37/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "img", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["img", "ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["ExpandDims", "Variable"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments/mean", "op": "Mean", "input": ["Conv2D", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D", "moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["Conv2D", "moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments/variance", "op": "Mean", "input": ["moments/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["moments/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow", "op": "Rsqrt", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "Mul", "input": ["Variable_2", "pow"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["truediv", "sub"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "add_1", "op": "Add", "input": ["mul", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["Relu", "Variable_3"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_1/mean", "op": "Mean", "input": ["Conv2D_1", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_1/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_1", "moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["Conv2D_1", "moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_1/variance", "op": "Mean", "input": ["moments_1/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add_2", "op": "Add", "input": ["moments_1/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_1", "op": "Rsqrt", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "Mul", "input": ["Variable_5", "pow_1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_1", "op": "Mul", "input": ["truediv_1", "sub_1"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_3", "op": "Add", "input": ["mul_1", "Variable_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_2", "op": "Conv2D", "input": ["Relu_1", "Variable_6"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_2/mean", "op": "Mean", "input": ["Conv2D_2", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_2/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_2", "moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["Conv2D_2", "moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_2/variance", "op": "Mean", "input": ["moments_2/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add_4", "op": "Add", "input": ["moments_2/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_2", "op": "Rsqrt", "input": ["add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "Mul", "input": ["Variable_8", "pow_2"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_2", "op": "Mul", "input": ["truediv_2", "sub_2"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_5", "op": "Add", "input": ["mul_2", "Variable_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_2", "op": "Relu", "input": ["add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_3", "op": "Conv2D", "input": ["Relu_2", "Variable_9"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_3/mean", "op": "Mean", "input": ["Conv2D_3", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_3/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_3", "moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_3", "op": "Sub", "input": ["Conv2D_3", "moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_3/variance", "op": "Mean", "input": ["moments_3/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_6", "op": "Add", "input": ["moments_3/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_3", "op": "Rsqrt", "input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "Mul", "input": ["Variable_11", "pow_3"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["truediv_3", "sub_3"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_7", "op": "Add", "input": ["mul_3", "Variable_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_4", "op": "Conv2D", "input": ["Relu_3", "Variable_12"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_4/mean", "op": "Mean", "input": ["Conv2D_4", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_4/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_4", "moments_4/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_4", "op": "Sub", "input": ["Conv2D_4", "moments_4/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_4/variance", "op": "Mean", "input": ["moments_4/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_8", "op": "Add", "input": ["moments_4/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_4", "op": "Rsqrt", "input": ["add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "Mul", "input": ["Variable_14", "pow_4"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_4", "op": "Mul", "input": ["truediv_4", "sub_4"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_10", "op": "AddN", "input": ["Relu_2", "mul_4"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_10", "op": "Add", "input": ["Variable_13", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_10"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "Conv2D_5", "op": "Conv2D", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_10", "Variable_15"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_5/mean", "op": "Mean", "input": ["Conv2D_5", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_5/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_5", "moments_5/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_5", "op": "Sub", "input": ["Conv2D_5", "moments_5/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_5/variance", "op": "Mean", "input": ["moments_5/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_11", "op": "Add", "input": ["moments_5/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_5", "op": "Rsqrt", "input": ["add_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "Mul", "input": ["Variable_17", "pow_5"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_5", "op": "Mul", "input": ["truediv_5", "sub_5"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_12", "op": "Add", "input": ["mul_5", "Variable_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_4", "op": "Relu", "input": ["add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_6", "op": "Conv2D", "input": ["Relu_4", "Variable_18"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_6/mean", "op": "Mean", "input": ["Conv2D_6", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_6/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_6", "moments_6/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_6", "op": "Sub", "input": ["Conv2D_6", "moments_6/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_6/variance", "op": "Mean", "input": ["moments_6/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_13", "op": "Add", "input": ["moments_6/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_6", "op": "Rsqrt", "input": ["add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_6", "op": "Mul", "input": ["Variable_20", "pow_6"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["truediv_6", "sub_6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_15", "op": "AddN", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_10", "mul_6"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_15", "op": "Add", "input": ["Variable_19", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_15"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "Conv2D_7", "op": "Conv2D", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_15", "Variable_21"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_7/mean", "op": "Mean", "input": ["Conv2D_7", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_7/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_7", "moments_7/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_7", "op": "Sub", "input": ["Conv2D_7", "moments_7/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_7/variance", "op": "Mean", "input": ["moments_7/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_16", "op": "Add", "input": ["moments_7/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_7", "op": "Rsqrt", "input": ["add_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_7", "op": "Mul", "input": ["Variable_23", "pow_7"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_7", "op": "Mul", "input": ["truediv_7", "sub_7"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "add_17", "op": "Add", "input": ["mul_7", "Variable_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_5", "op": "Relu", "input": ["add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_8", "op": "Conv2D", "input": ["Relu_5", "Variable_24"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_8/mean", "op": "Mean", "input": ["Conv2D_8", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_8/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_8", "moments_8/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_8", "op": "Sub", "input": ["Conv2D_8", "moments_8/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_8/variance", "op": "Mean", "input": ["moments_8/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add_18", "op": "Add", "input": ["moments_8/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_8", "op": "Rsqrt", "input": ["add_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_8", "op": "Mul", "input": ["Variable_26", "pow_8"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_8", "op": "Mul", "input": ["truediv_8", "sub_8"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_20", "op": "AddN", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_15", "mul_8"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_20", "op": "Add", "input": ["Variable_25", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_20"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "Conv2D_9", "op": "Conv2D", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_20", "Variable_27"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_9/mean", "op": "Mean", "input": ["Conv2D_9", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_9/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_9", "moments_9/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_9", "op": "Sub", "input": ["Conv2D_9", "moments_9/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_9/variance", "op": "Mean", "input": ["moments_9/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_21", "op": "Add", "input": ["moments_9/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_9", "op": "Rsqrt", "input": ["add_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_9", "op": "Mul", "input": ["Variable_29", "pow_9"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["truediv_9", "sub_9"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "add_22", "op": "Add", "input": ["mul_9", "Variable_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_6", "op": "Relu", "input": ["add_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_10", "op": "Conv2D", "input": ["Relu_6", "Variable_30"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_10/mean", "op": "Mean", "input": ["Conv2D_10", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_10/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_10", "moments_10/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_10", "op": "Sub", "input": ["Conv2D_10", "moments_10/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_10/variance", "op": "Mean", "input": ["moments_10/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_23", "op": "Add", "input": ["moments_10/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_10", "op": "Rsqrt", "input": ["add_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_10", "op": "Mul", "input": ["Variable_32", "pow_10"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_10", "op": "Mul", "input": ["truediv_10", "sub_10"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_25", "op": "AddN", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_20", "mul_10"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_25", "op": "Add", "input": ["Variable_31", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_25"], "attr": {"_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_11", "op": "Conv2D", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_25", "Variable_33"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_11/mean", "op": "Mean", "input": ["Conv2D_11", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_11/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_11", "moments_11/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_11", "op": "Sub", "input": ["Conv2D_11", "moments_11/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_11/variance", "op": "Mean", "input": ["moments_11/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_26", "op": "Add", "input": ["moments_11/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_11", "op": "Rsqrt", "input": ["add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_11", "op": "Mul", "input": ["Variable_35", "pow_11"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_11", "op": "Mul", "input": ["truediv_11", "sub_11"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_27", "op": "Add", "input": ["mul_11", "Variable_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_7", "op": "Relu", "input": ["add_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_12", "op": "Conv2D", "input": ["Relu_7", "Variable_36"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_12/mean", "op": "Mean", "input": ["Conv2D_12", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_12/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_12", "moments_12/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_12", "op": "Sub", "input": ["Conv2D_12", "moments_12/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_12/variance", "op": "Mean", "input": ["moments_12/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_28", "op": "Add", "input": ["moments_12/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_12", "op": "Rsqrt", "input": ["add_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_12", "op": "Mul", "input": ["Variable_38", "pow_12"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_12", "op": "Mul", "input": ["truediv_12", "sub_12"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_30", "op": "AddN", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_25", "mul_12"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_30", "op": "Add", "input": ["Variable_37", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_30"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}}}, {"name": "conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["stack", "Variable_39", "ArithmeticOptimizer/AddOpsRewrite_add_30"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_13/mean", "op": "Mean", "input": ["conv2d_transpose", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_13/SquaredDifference", "op": "SquaredDifference", "input": ["conv2d_transpose", "moments_13/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_13", "op": "Sub", "input": ["conv2d_transpose", "moments_13/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_13/variance", "op": "Mean", "input": ["moments_13/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_31", "op": "Add", "input": ["moments_13/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_13", "op": "Rsqrt", "input": ["add_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_13", "op": "Mul", "input": ["Variable_41", "pow_13"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_13", "op": "Mul", "input": ["truediv_13", "sub_13"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_32", "op": "Add", "input": ["mul_13", "Variable_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_8", "op": "Relu", "input": ["add_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_1", "op": "Conv2DBackpropInput", "input": ["stack_1", "Variable_42", "Relu_8"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_14/mean", "op": "Mean", "input": ["conv2d_transpose_1", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_14/SquaredDifference", "op": "SquaredDifference", "input": ["conv2d_transpose_1", "moments_14/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_14", "op": "Sub", "input": ["conv2d_transpose_1", "moments_14/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_14/variance", "op": "Mean", "input": ["moments_14/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add_33", "op": "Add", "input": ["moments_14/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_14", "op": "Rsqrt", "input": ["add_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_14", "op": "Mul", "input": ["Variable_44", "pow_14"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "mul_14", "op": "Mul", "input": ["truediv_14", "sub_14"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_34", "op": "Add", "input": ["mul_14", "Variable_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_9", "op": "Relu", "input": ["add_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_13", "op": "Conv2D", "input": ["Relu_9", "Variable_45"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "moments_15/mean", "op": "Mean", "input": ["Conv2D_13", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_15/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_13", "moments_15/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_15", "op": "Sub", "input": ["Conv2D_13", "moments_15/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_15/variance", "op": "Mean", "input": ["moments_15/SquaredDifference", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_35", "op": "Add", "input": ["moments_15/variance", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_15", "op": "Rsqrt", "input": ["add_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_15", "op": "Mul", "input": ["Variable_47", "pow_15"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_15", "op": "Mul", "input": ["truediv_15", "sub_15"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_36", "op": "Add", "input": ["mul_15", "Variable_46"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tanh", "op": "Tanh", "input": ["add_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_16", "op": "Mul", "input": ["Tanh", "mul_16/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_37", "op": "Add", "input": ["mul_16", "add_37/y"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "Variable_47", "shape": [3], "dtype": "float32", "quantization": {"min": 0.459183007478714, "scale": 0.00026842811528374167, "dtype": "uint8"}}, {"name": "Variable_44", "shape": [32], "dtype": "float32", "quantization": {"min": 0.6503245234489441, "scale": 0.001943969025331385, "dtype": "uint8"}}, {"name": "stack_1", "shape": [4], "dtype": "int32", "quantization": {"min": 1.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "Variable_42", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.6309285671103234, "scale": 0.004816248603895599, "dtype": "uint8"}}, {"name": "Variable_41", "shape": [64], "dtype": "float32", "quantization": {"min": 0.8334143161773682, "scale": 0.0011313228046192843, "dtype": "uint8"}}, {"name": "stack", "shape": [4], "dtype": "int32", "quantization": {"min": 1.0, "scale": 0.4980392156862745, "dtype": "uint8"}}, {"name": "Variable_39", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.7848459369996015, "scale": 0.006084077031004663, "dtype": "uint8"}}, {"name": "Variable_37", "shape": [128], "dtype": "float32", "quantization": {"min": -0.16061228057917426, "scale": 0.001029565901148553, "dtype": "uint8"}}, {"name": "Variable_38", "shape": [128], "dtype": "float32", "quantization": {"min": 1.0560882091522217, "scale": 0.003566873774808996, "dtype": "uint8"}}, {"name": "Variable_35", "shape": [128], "dtype": "float32", "quantization": {"min": 0.6057859063148499, "scale": 0.002507025354048785, "dtype": "uint8"}}, {"name": "Variable_31", "shape": [128], "dtype": "float32", "quantization": {"min": -0.1362938170923906, "scale": 0.0009086254472826041, "dtype": "uint8"}}, {"name": "Variable_32", "shape": [128], "dtype": "float32", "quantization": {"min": 0.5810896754264832, "scale": 0.004284874364441516, "dtype": "uint8"}}, {"name": "Variable_29", "shape": [128], "dtype": "float32", "quantization": {"min": 0.46972784399986267, "scale": 0.0030541617496340884, "dtype": "uint8"}}, {"name": "Variable_25", "shape": [128], "dtype": "float32", "quantization": {"min": -0.13705040572905072, "scale": 0.0008729325205672021, "dtype": "uint8"}}, {"name": "Variable_26", "shape": [128], "dtype": "float32", "quantization": {"min": 0.26957494020462036, "scale": 0.0049437539250242945, "dtype": "uint8"}}, {"name": "Variable_23", "shape": [128], "dtype": "float32", "quantization": {"min": 0.3909907937049866, "scale": 0.0035050403838064155, "dtype": "uint8"}}, {"name": "Variable_19", "shape": [128], "dtype": "float32", "quantization": {"min": -0.15929982744011226, "scale": 0.0010146485824210972, "dtype": "uint8"}}, {"name": "Variable_20", "shape": [128], "dtype": "float32", "quantization": {"min": 0.36599451303482056, "scale": 0.004128146405313529, "dtype": "uint8"}}, {"name": "Variable_17", "shape": [128], "dtype": "float32", "quantization": {"min": 0.4773179590702057, "scale": 0.004073594013849894, "dtype": "uint8"}}, {"name": "Variable_13", "shape": [128], "dtype": "float32", "quantization": {"min": -0.13014311965774086, "scale": 0.0013993883834165686, "dtype": "uint8"}}, {"name": "Variable_14", "shape": [128], "dtype": "float32", "quantization": {"min": 0.5134620666503906, "scale": 0.0030489795348223516, "dtype": "uint8"}}, {"name": "Variable_11", "shape": [128], "dtype": "float32", "quantization": {"min": 0.5957207083702087, "scale": 0.0038743830194660264, "dtype": "uint8"}}, {"name": "Variable_8", "shape": [128], "dtype": "float32", "quantization": {"min": 0.46687859296798706, "scale": 0.003652843073302624, "dtype": "uint8"}}, {"name": "Variable_5", "shape": [64], "dtype": "float32", "quantization": {"min": 0.47610586881637573, "scale": 0.006043442791583491, "dtype": "uint8"}}, {"name": "Variable_2", "shape": [32], "dtype": "float32", "quantization": {"min": 0.364621102809906, "scale": 0.004869737110885919, "dtype": "uint8"}}, {"name": "add/y", "shape": [], "dtype": "float32", "quantization": {"min": 0.0010000000474974513, "scale": 1.0, "dtype": "uint8"}}, {"name": "ExpandDims/dim", "shape": [], "dtype": "int32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "Variable", "shape": [9, 9, 3, 32], "dtype": "float32", "quantization": {"min": -1.0571087093914258, "scale": 0.007392368597142837, "dtype": "uint8"}}, {"name": "Variable_1", "shape": [32], "dtype": "float32", "quantization": {"min": -0.41260254897323306, "scale": 0.008969620629852893, "dtype": "uint8"}}, {"name": "Variable_3", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -1.2586732228597004, "scale": 0.009254950168086033, "dtype": "uint8"}}, {"name": "Variable_4", "shape": [64], "dtype": "float32", "quantization": {"min": -0.686617465580211, "scale": 0.007629082950891233, "dtype": "uint8"}}, {"name": "Variable_6", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -1.1996711001676672, "scale": 0.009521199207679899, "dtype": "uint8"}}, {"name": "Variable_7", "shape": [128], "dtype": "float32", "quantization": {"min": -0.8447105098004436, "scale": 0.004287870608124079, "dtype": "uint8"}}, {"name": "Variable_9", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.5809614340464273, "scale": 0.010828502972920736, "dtype": "uint8"}}, {"name": "Variable_10", "shape": [128], "dtype": "float32", "quantization": {"min": -1.4233628020567053, "scale": 0.00677791810503193, "dtype": "uint8"}}, {"name": "Variable_12", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.0492064069299136, "scale": 0.00765844092649572, "dtype": "uint8"}}, {"name": "Variable_15", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.1580321760738597, "scale": 0.008642031164730297, "dtype": "uint8"}}, {"name": "Variable_16", "shape": [128], "dtype": "float32", "quantization": {"min": -2.024259344035504, "scale": 0.009415159739700018, "dtype": "uint8"}}, {"name": "Variable_18", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.7827419421252082, "scale": 0.012554520719191607, "dtype": "uint8"}}, {"name": "Variable_21", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.3379357555333307, "scale": 0.009101603779138304, "dtype": "uint8"}}, {"name": "Variable_22", "shape": [128], "dtype": "float32", "quantization": {"min": -2.3710259450416937, "scale": 0.010632403340994143, "dtype": "uint8"}}, {"name": "Variable_24", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -3.3024355420879288, "scale": 0.025800277672561944, "dtype": "uint8"}}, {"name": "Variable_27", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.059021033258999, "scale": 0.007962564159842098, "dtype": "uint8"}}, {"name": "Variable_28", "shape": [128], "dtype": "float32", "quantization": {"min": -2.7064252487584657, "scale": 0.01213643609308729, "dtype": "uint8"}}, {"name": "Variable_30", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -3.6171144130183204, "scale": 0.028936915304146563, "dtype": "uint8"}}, {"name": "Variable_33", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.8701988940145455, "scale": 0.007501714603573668, "dtype": "uint8"}}, {"name": "Variable_34", "shape": [128], "dtype": "float32", "quantization": {"min": -2.578766494989395, "scale": 0.01146118442217509, "dtype": "uint8"}}, {"name": "Variable_36", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -1.6433504740397136, "scale": 0.013809667849073223, "dtype": "uint8"}}, {"name": "Variable_40", "shape": [64], "dtype": "float32", "quantization": {"min": -0.6357365588347117, "scale": 0.003512356678644816, "dtype": "uint8"}}, {"name": "Variable_43", "shape": [32], "dtype": "float32", "quantization": {"min": -0.17142329145880306, "scale": 0.0020407534697476555, "dtype": "uint8"}}, {"name": "Variable_45", "shape": [9, 9, 32, 3], "dtype": "float32", "quantization": {"min": -0.9072221952326158, "scale": 0.006872895418428907, "dtype": "uint8"}}, {"name": "moments/mean/reduction_indices", "shape": [2], "dtype": "int32", "quantization": {"min": 1.0, "scale": 0.00392156862745098, "dtype": "uint8"}}, {"name": "Variable_46", "shape": [3], "dtype": "float32", "quantization": {"min": -0.41028231382369995, "scale": 0.0012035139343317817, "dtype": "uint8"}}, {"name": "mul_16/y", "shape": [], "dtype": "float32", "quantization": {"min": 150.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "add_37/y", "shape": [], "dtype": "float32", "quantization": {"min": 127.5, "scale": 1.0, "dtype": "uint8"}}]}]}